# Module 4 Project -Task 2

Author: [Hayley Massey](https://github.com/HMas522)
Repository: [datafun-04-notebooks](https://github.com/HMas522/datafun-04-notebooks)

# Task 2.1

In [1]:
#This cell is Python
import pandas as pd

In [33]:
#Create a dictionary
grades_dict = {'Zelda': [100, 99, 95], 'Mario': [80, 70, 75], 'Kirby' : [95, 100, 80], 'Samus' : [95, 78, 89], 'Pikachu' : [60, 71, 79]}


#Define Data frame
grades =pd.DataFrame(grades_dict)

#Produce dictionary
grades

   Zelda  Mario  Kirby  Samus  Pikachu
0    100     80     95     95       60
1     99     70    100     78       71
2     95     75     80     89       79

# Task 2.2

In [34]:
#Index the attribute ie. label the test number
grades.index = ['Test 1', 'Test 2', 'Test 3']

#Output the new index'd attribute
grades

        Zelda  Mario  Kirby  Samus  Pikachu
Test 1    100     80     95     95       60
Test 2     99     70    100     78       71
Test 3     95     75     80     89       79

In [35]:
#TODO Find Sam's grades
grades.Kirby

Test 1     95
Test 2    100
Test 3     80
Name: Kirby, dtype: int64

# Task 2.3 loc & iloc

In [36]:
#TODO use loc attribute - I prefer this method
grades.loc['Test 1']

Zelda      100
Mario       80
Kirby       95
Samus       95
Pikachu     60
Name: Test 1, dtype: int64

In [37]:
#TODO use iloc attribute - Test 2
grades.iloc[1]

Zelda       99
Mario       70
Kirby      100
Samus       78
Pikachu     71
Name: Test 2, dtype: int64

In [38]:
#TODO display test 1 through 3 
grades.loc['Test 1': 'Test 3']

        Zelda  Mario  Kirby  Samus  Pikachu
Test 1    100     80     95     95       60
Test 2     99     70    100     78       71
Test 3     95     75     80     89       79

In [39]:
#TODO exclude test 3
grades.iloc[0:2]

        Zelda  Mario  Kirby  Samus  Pikachu
Test 1    100     80     95     95       60
Test 2     99     70    100     78       71

In [40]:
#Specify rows with loc
grades.loc[['Test 1', 'Test 3']]

        Zelda  Mario  Kirby  Samus  Pikachu
Test 1    100     80     95     95       60
Test 3     95     75     80     89       79

In [41]:
#Specify rows with iloc
grades.iloc[[0,2]]

        Zelda  Mario  Kirby  Samus  Pikachu
Test 1    100     80     95     95       60
Test 3     95     75     80     89       79

# Task 2.3 Subsets at & iat

In [43]:
#TODO create subset with at -Eva's 2nd Test score
grades.at['Test 2', 'Mario']

70

In [44]:
#TODO create subset using indices - Wally's 3rd exam score
grades.iat[0,2]

95

# Task 2.4 Describe Column

In [45]:
#TODO call describe to get a list of stats for grades
grades.describe()

        Zelda  Mario   Kirby  Samus  Pikachu
count    3.00    3.0    3.00   3.00     3.00
mean    98.00   75.0   91.67  87.33    70.00
std      2.65    5.0   10.41   8.62     9.54
min     95.00   70.0   80.00  78.00    60.00
25%     97.00   72.5   87.50  83.50    65.50
50%     99.00   75.0   95.00  89.00    71.00
75%     99.50   77.5   97.50  92.00    75.00
max    100.00   80.0  100.00  95.00    79.00

In [46]:
#TODO Round using precision -using updated version
pd.set_option("display.precision",2)

grades.describe()

        Zelda  Mario   Kirby  Samus  Pikachu
count    3.00    3.0    3.00   3.00     3.00
mean    98.00   75.0   91.67  87.33    70.00
std      2.65    5.0   10.41   8.62     9.54
min     95.00   70.0   80.00  78.00    60.00
25%     97.00   72.5   87.50  83.50    65.50
50%     99.00   75.0   95.00  89.00    71.00
75%     99.50   77.5   97.50  92.00    75.00
max    100.00   80.0  100.00  95.00    79.00

# Task 2.5 Transpose

In [47]:
#TODO Get average for each column
grades.mean()

Zelda      98.00
Mario      75.00
Kirby      91.67
Samus      87.33
Pikachu    70.00
dtype: float64

In [48]:
#TODO Transpose rows and columns
grades.T

         Test 1  Test 2  Test 3
Zelda       100      99      95
Mario        80      70      75
Kirby        95     100      80
Samus        95      78      89
Pikachu      60      71      79

In [49]:
#TODO Now call the stats of the new transposition
grades.T.describe()

       Test 1  Test 2  Test 3
count    5.00    5.00    5.00
mean    86.00   83.60   83.60
std     16.36   14.84    8.17
min     60.00   70.00   75.00
25%     80.00   71.00   79.00
50%     95.00   78.00   80.00
75%     95.00   99.00   89.00
max    100.00  100.00   95.00

In [50]:
#TODO get new mean with tranposition
grades.T.mean()

Test 1    86.0
Test 2    83.6
Test 3    83.6
dtype: float64

# Task 2.6 Sort

In [51]:
#TODO sort the rows - using boolean sort descending tests
grades.sort_index(ascending=False)

        Zelda  Mario  Kirby  Samus  Pikachu
Test 3     95     75     80     89       79
Test 2     99     70    100     78       71
Test 1    100     80     95     95       60

In [52]:
#sort the columns - alphabetically
grades.sort_index(axis=1)

        Kirby  Mario  Pikachu  Samus  Zelda
Test 1     95     80       60     95    100
Test 2    100     70       71     78     99
Test 3     80     75       79     89     95